Catalogs/Кошельки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Кошельки</Name>
			<Comment>Банк, Наличные, Акции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачальногоОстатка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОсновнойКошелек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОсновнойКошелек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Кошельки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НачальныйОстатокПриИзменении(Элемент)
	Если Объект.НачальныйОстаток <> 0 Тогда
		Объект.ДатаНачальногоОстатка = ТекущаяДата();		
	Иначе
		Объект.ДатаНачальногоОстатка = '00000000000000';	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПервыйВход() Тогда
		Объект.Основной = Истина;
		Объект.Активность = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ОсновнойКошелек.Основной КАК Основной
		                      |ИЗ
		                      |	РегистрСведений.ОсновнойКошелек КАК ОсновнойКошелек
		                      |ГДЕ
		                      |	ОсновнойКошелек.Кошелек = &Кошелек");
	Запрос.УстановитьПараметр("Кошелек",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Объект.Основной = Выборка.Основной;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПервыйВход() Тогда
		Элементы.ДекорацияОсновной.Видимость = Истина;
		Элементы.Основной.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ГруппаНачальныйОстаток.Видимость = Ложь;
		Элементы.ДекорацияОсновной.Видимость = Ложь;
		
	КонецЕсли;
КонецПроцедуры 

Функция ПервыйВход()

	Если НЕ Константы.БылВходРаньше.Получить() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли;	

КонецФункции // ПроверитьПервыйВход()


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Вставить содержимое обработчика
КонецПроцедуры
